Repository: python/python-docs-ja
Catalog: library/*.po
Languages: ast, gl

source: ``global`` and ``nonlocal`` statements. ``names`` is a list of raw strings.
ast: ``global`` および ``nonlocal`` 文です。 ``names`` は生の文字列のリストです。

source: A class definition.
ast: クラス定義です。

source: ``name`` is a raw string for the class name
ast: ``name`` はクラス名をあらわす生の文字列です。

source: ``bases`` is a list of nodes for explicitly specified base classes.
ast: ``bases`` は明示的に指定された基底クラスをあらわすノードのリストです。

source: ``body`` is a list of nodes representing the code within the class definition.
ast: ``body`` はクラス定義に含まれるコードをあらわすノードのリストです。

source: ``decorator_list`` is a list of nodes, as in :class:`FunctionDef`.
ast: ``decorator_list`` はノードのリストで、関数定義 :class:`FunctionDef` の場合と同様に解釈されます。

source: Async and await
ast: async と await

source: An ``async def`` function definition. Has the same fields as :class:`FunctionDef`.
ast: ``async def`` 形式の関数定義です。通常の関数定義 :class:`FunctionDef` と同じフィールドを持ちます。

source: An ``await`` expression. ``value`` is what it waits for. Only valid in the body of an :class:`AsyncFunctionDef`.
ast: ``await`` 式をあらわします。 ``value`` は待ち受ける値です。 :class:`AsyncFunctionDef` の本体 (body) の中でのみ有効です。

source: ``async for`` loops and ``async with`` context managers. They have the same fields as :class:`For` and :class:`With`, respectively. Only valid in the body of an :class:`AsyncFunctionDef`.
ast: ``async for`` ループと ``async with`` コンテキストマネージャです。それぞれ :class:`For` および :class:`With` と同じフィールドを持ちます。 :class:`AsyncFunctionDef` の本体 (body) の中でのみ有効です。

source: When a string is parsed by :func:`ast.parse`, operator nodes (subclasses of :class:`ast.operator`, :class:`ast.unaryop`, :class:`ast.cmpop`, :class:`ast.boolop` and :class:`ast.expr_context`) on the returned tree will be singletons. Changes to one will be reflected in all other occurrences of the same value (e.g. :class:`ast.Add`).
ast: 文字列が :func:`ast.parse` によってパースされたとき、戻り値のツリーに含まれる演算子ノード (:class:`ast.operator`, :class:`ast.unaryop`, :class:`ast.cmpop`, :class:`ast.boolop` および :class:`ast.expr_context` のサブクラス) はシングルトンです。したがっていずれかの演算子ノードを変更すると、その変更は他の全ての同じ値 (たとえば :class:`ast.Add` ノードを変更した場合はその他全ての :class:`ast.Add` ノード) に反映されます。

source: :mod:`ast` Helpers
ast: :mod:`ast` ヘルパー

source: Apart from the node classes, the :mod:`ast` module defines these utility functions and classes for traversing abstract syntax trees:
ast: ノード・クラスの他に、 :mod:`ast` モジュールは以下のような抽象構文木をトラバースするためのユーティリティ関数やクラスも定義しています:

source: If ``type_comments=True`` is given, the parser is modified to check and return type comments as specified by :pep:`484` and :pep:`526`. This is equivalent to adding :data:`ast.PyCF_TYPE_COMMENTS` to the flags passed to :func:`compile()`. This will report syntax errors for misplaced type comments. Without this flag, type comments will be ignored, and the ``type_comment`` field on selected AST nodes will always be ``None``. In addition, the locations of ``# type: ignore`` comments will be returned as the ``type_ignores`` attribute of :class:`Module` (otherwise it is always an empty list).
ast: ``type_comments=True`` が与えられると、パーサは :pep:`484` および :pep:`526` で規定された型コメントをチェックし、返すように修正されます。これは :data:`ast.PyCF_TYPE_COMMENTS` を追加したフラグを :func:`compile()` に渡すことと等価です。パーサは不適切な場所に配置された型コメントに対してシンタックスエラーをレポートします。 このフラグがない場合、型コメントは無視されて AST ノードの ``type_comment`` フィールドは常に ``None`` になります。さらに、 ``# type: ignore`` コメントの位置は :class:`Module` の ``type_ignores`` 属性として返されます (それ以外の場合は常に空のリストになります)。

source: In addition, if ``mode`` is ``'func_type'``, the input syntax is modified to correspond to :pep:`484` "signature type comments", e.g. ``(str, int) -> List[str]``.
ast: さらに ``mode`` が ``'func_type'`` の場合、入力構文は、たとえば ``(str, int) -> List[str]`` のような :pep:`484` の "シグネチャ型コメント (signature type comments)" に対応するように修正されます。

source: It is possible to crash the Python interpreter with a sufficiently large/complex string due to stack depth limitations in Python's AST compiler.
ast: 十分に大きい文字列や複雑な文字列によって Python の抽象構文木コンパイラのスタックの深さの限界を越えることで、 Python インタプリタをクラッシュさせることができます。

source: Added ``type_comments``, ``mode='func_type'`` and ``feature_version``.
ast: ``type_comments``、``mode='func_type'``、``feature_version`` が追加されました。

source: Unparse an :class:`ast.AST` object and generate a string with code that would produce an equivalent :class:`ast.AST` object if parsed back with :func:`ast.parse`.
ast: :class:`ast.AST` オブジェクトを逆に構文解析して、 :func:`ast.parse` が元の :class:`ast.AST` と等価なオブジェクトを生成できるような文字列を生成します。

source: The produced code string will not necessarily be equal to the original code that generated the :class:`ast.AST` object (without any compiler optimizations, such as constant tuples/frozensets).
ast: 生成されたコード文字列は、生成元のコードである :class:`ast.AST` オブジェクトと必ずしも等価であるとは限りません (定数タプルや frozenset などに対するコンパイラ最適化なしのコードです)。

source: Trying to unparse a highly complex expression would result with :exc:`RecursionError`.
ast: 非常に複雑な式を逆構文解析すると :exc:`RecursionError` となることがあります。

source: Evaluate an expression node or a string containing only a Python literal or container display. The string or node provided may only consist of the following Python literal structures: strings, bytes, numbers, tuples, lists, dicts, sets, booleans, ``None`` and ``Ellipsis``.
ast: Python のリテラルやコンテナ表現のみを含む式ノードまたは文字列を評価します。与えられる文字列またはノードは次の Python リテラル構造のみからなるものに限られます: 文字列、バイト列、数、タプル、リスト、辞書、集合、ブール値、``None``、``Ellipsis``。

source: This can be used for evaluating strings containing Python values without the need to parse the values oneself. It is not capable of evaluating arbitrarily complex expressions, for example involving operators or indexing.
ast: この関数は Python の式を含んだ文字列を、値自身を解析することなしに評価するのに使えます。この関数は、例えば演算や添え字を含んだ任意の複雑な表現を評価するのには使えません。

source: It is possible to crash the Python interpreter due to stack depth limitations in Python's AST compiler.
ast: Python の抽象構文木コンパイラのスタックの深さの限界を越えることで、 Python インタプリタをクラッシュさせる可能性があります。

source: Now allows bytes and set literals.
ast: バイト列リテラルと集合リテラルが受け取れるようになりました。

source: Now supports creating empty sets with ``'set()'``.
ast: ``'set()'`` による空の集合の生成をサポートするようになりました。

source: Return the docstring of the given *node* (which must be a :class:`FunctionDef`, :class:`AsyncFunctionDef`, :class:`ClassDef`, or :class:`Module` node), or ``None`` if it has no docstring. If *clean* is true, clean up the docstring's indentation with :func:`inspect.cleandoc`.
ast: 与えられた *node* (これは :class:`FunctionDef`, :class:`AsyncFunctionDef`, :class:`ClassDef`, :class:`Module` のいずれかのノードでなければなりません) のドキュメント文字列を返します。もしドキュメント文字列が無ければ ``None`` を返します。 *clean* が真ならば、ドキュメント文字列のインデントを :func:`inspect.cleandoc` を用いて一掃します。

source: :class:`AsyncFunctionDef` is now supported.
ast: :class:`AsyncFunctionDef` がサポートされました。

source: If *padded* is ``True``, the first line of a multi-line statement will be padded with spaces to match its original position.
ast: *padded* が ``True`` の場合、複数行にわたる文の最初の行が元の位置に一致するように空白文字でパディングされます。

source: Increment the line number and end line number of each node in the tree starting at *node* by *n*. This is useful to "move code" to a different location in a file.
ast: *node* で始まるツリー内の各ノードの行番号と終了行番号を *n* ずつ増やします。これはファイルの中で別の場所に "コードを移動する" ときに便利です。

source: Yield a tuple of ``(fieldname, value)`` for each field in ``node._fields`` that is present on *node*.
ast: *node* にある ``node._fields`` のそれぞれのフィールドを ``(フィールド名, 値)`` のタプルとして yield します。

source: Yield all direct child nodes of *node*, that is, all fields that are nodes and all items of fields that are lists of nodes.
ast: *node* の直接の子ノード全てを yield します。すなわち、yield されるのは、ノードであるような全てのフィールドおよびノードのリストであるようなフィールドの全てのアイテムです。

source: Recursively yield all descendant nodes in the tree starting at *node* (including *node* itself), in no specified order. This is useful if you only want to modify nodes in place and don't care about the context.
ast: *node* の全ての子孫ノード(*node* 自体を含む)を再帰的に yield します。順番は決められていません。この関数はノードをその場で変更するだけで文脈を気にしないような場合に便利です。

source: A node visitor base class that walks the abstract syntax tree and calls a visitor function for every node found. This function may return a value which is forwarded by the :meth:`visit` method.
ast: 抽象構文木を渡り歩いてビジター関数を見つけたノードごとに呼び出すノード・ビジターの基底クラスです。この関数は :meth:`visit` メソッドに送られる値を返してもかまいません。

source: This class is meant to be subclassed, with the subclass adding visitor methods.
ast: このクラスはビジター・メソッドを付け加えたサブクラスを派生させることを意図しています。

source: Visit a node. The default implementation calls the method called :samp:`self.visit_{classname}` where *classname* is the name of the node class, or :meth:`generic_visit` if that method doesn't exist.
ast: ノードを訪れます。デフォルトの実装では :samp:`self.visit_{classname}` というメソッド (ここで *classname* はノードのクラス名です) を呼び出すか、そのメソッドがなければ :meth:`generic_visit` を呼び出します。

source: This visitor calls :meth:`visit` on all children of the node.
ast: このビジターはノードの全ての子について :meth:`visit` を呼び出します。

source: Note that child nodes of nodes that have a custom visitor method won't be visited unless the visitor calls :meth:`generic_visit` or visits them itself.
ast: 注意して欲しいのは、専用のビジター・メソッドを具えたノードの子ノードは、このビジターが :meth:`generic_visit` を呼び出すかそれ自身で子ノードを訪れない限り訪れられないということです。

source: Don't use the :class:`NodeVisitor` if you want to apply changes to nodes during traversal. For this a special visitor exists (:class:`NodeTransformer`) that allows modifications.
ast: トラバースの途中でノードを変化させたいならば :class:`NodeVisitor` を使ってはいけません。そうした目的のために変更を許す特別なビジター (:class:`NodeTransformer`) があります。

source: A :class:`NodeVisitor` subclass that walks the abstract syntax tree and allows modification of nodes.
ast: :class:`NodeVisitor` のサブクラスで抽象構文木を渡り歩きながらノードを変更することを許すものです。

source: The :class:`NodeTransformer` will walk the AST and use the return value of the visitor methods to replace or remove the old node. If the return value of the visitor method is ``None``, the node will be removed from its location, otherwise it is replaced with the return value. The return value may be the original node in which case no replacement takes place.
ast: :class:`NodeTransformer` は抽象構文木(AST)を渡り歩き、ビジター・メソッドの戻り値を使って古いノードを置き換えたり削除したりします。ビジター・メソッドの戻り値が ``None`` ならば、ノードはその場から取り去られ、そうでなければ戻り値で置き換えられます。置き換えない場合は戻り値が元のノードそのものであってもかまいません。

source: Here is an example transformer that rewrites all occurrences of name lookups (``foo``) to ``data['foo']``::
ast: それでは例を示しましょう。Name (たとえば ``foo``) を見つけるたび全て ``data['foo']`` に書き換える変換器 (transformer) です::

source: For nodes that were part of a collection of statements (that applies to all statement nodes), the visitor may also return a list of nodes rather than just a single node.
ast: 文のコレクションであるようなノード (全ての文のノードが当てはまります) に対して、このビジターは単独のノードではなくノードのリストを返すかもしれません。

source: Usually you use the transformer like this::
ast: たいてい、変換器の使い方は次のようになります::

source: Return a formatted dump of the tree in *node*. This is mainly useful for debugging purposes. If *annotate_fields* is true (by default), the returned string will show the names and the values for fields. If *annotate_fields* is false, the result string will be more compact by omitting unambiguous field names. Attributes such as line numbers and column offsets are not dumped by default. If this is wanted, *include_attributes* can be set to true.
ast: *node* 内のツリーのフォーマットされたダンプを返します。主な使い道はデバッグです。 *annotate_fields* が true の場合 (デフォルト)、返される文字列はフィールドの名前と値を示します。 *annotate_fields* が false の場合、あいまいさのないフィールド名を省略することにより、結果文字列はよりコンパクトになります。行番号や列オフセットのような属性はデフォルトではダンプされません。これが必要であれば、 *include_attributes* を true にすると表示できます。

source: If *indent* is a non-negative integer or string, then the tree will be pretty-printed with that indent level. An indent level of 0, negative, or ``""`` will only insert newlines. ``None`` (the default) selects the single line representation. Using a positive integer indent indents that many spaces per level. If *indent* is a string (such as ``"\t"``), that string is used to indent each level.
ast: *indent* が非負の整数または文字列の場合、ツリーは指定されたインデントレベルで整形されて出力されます (pretty-printed)。インデントレベルがゼロ、負の数、または ``""`` の場合は改行だけを挿入します。 ``None`` (デフォルト値) は単一行での表記になります。正の整数を指定すると各インデントレベルでその数だけの空白でインデントされます。 *indent* が文字列 (``"\t"`` など) の場合、その文字列が各レベルのインデントに使われます。

source: Added the *indent* option.
ast: *indent* オプションを追加しました。

source: Compiler Flags
ast: コンパイラフラグ

source: The following flags may be passed to :func:`compile` in order to change effects on the compilation of a program:
ast: 以下のフラグはプログラムのコンパイルにおける効果を変更するために :func:`compile` に渡すことができます:

source: Enables support for top-level ``await``, ``async for``, ``async with`` and async comprehensions.
ast: トップレベルの ``await``, ``async for``, ``async with`` および async 内包表記のサポートを有効化します。

source: Generates and returns an abstract syntax tree instead of returning a compiled code object.
ast: コンパイルされたコードオブジェクトの代わりに抽象構文木を生成して返します。

source: Enables support for :pep:`484` and :pep:`526` style type comments (``# type: <type>``, ``# type: ignore <stuff>``).
ast: :pep:`484` および :pep:`526` 形式の型コメント (``# type: <type>``, ``# type: ignore <stuff>``) のサポートを有効化します。

source: Command-Line Usage
ast: コマンドラインからの使用

source: The :mod:`ast` module can be executed as a script from the command line. It is as simple as:
ast: :mod:`ast` モジュールはコマンドラインからスクリプトとして実行することができます。実行方法は単純です:

source: The following options are accepted:
ast: 以下のオプションが使用できます:

source: Show the help message and exit.
ast: ヘルプメッセージを表示して終了します。

source: Specify what kind of code must be compiled, like the *mode* argument in :func:`parse`.
ast: :func:`parse` 関数の *mode* 引数と同様、コンパイルするコードの種類を指定します。

source: Don't parse type comments.
ast: 型コメントをパースしません。

source: Include attributes such as line numbers and column offsets.
ast: 行番号や列オフセットなどの属性を含めます。

source: Indentation of nodes in AST (number of spaces).
ast: AST におけるノードのインデント (空白の数) です。

source: If :file:`infile` is specified its contents are parsed to AST and dumped to stdout. Otherwise, the content is read from stdin.
ast: :file:`infile` を指定するとその内容が AST にパースされて標準出力に出力されます。そうでない場合は標準入力から入力を読み込みます。

source: `Green Tree Snakes <https://greentreesnakes.readthedocs.io/>`_, an external documentation resource, has good details on working with Python ASTs.
ast: 外部ドキュメント `Green Tree Snakes <https://greentreesnakes.readthedocs.io/>`_ には Python AST についての詳細が書かれています。

source: `ASTTokens <https://asttokens.readthedocs.io/en/latest/user-guide.html>`_ annotates Python ASTs with the positions of tokens and text in the source code that generated them. This is helpful for tools that make source code transformations.
ast: `ASTTokens <https://asttokens.readthedocs.io/en/latest/user-guide.html>`_ は Python AST を、生成元のソースコードのトークン位置やテキストで注解します。これはソースコード変換を行うツールで有用です。

source: `LibCST <https://libcst.readthedocs.io/>`_ parses code as a Concrete Syntax Tree that looks like an ast tree and keeps all formatting details. It's useful for building automated refactoring (codemod) applications and linters.
ast: `LibCST <https://libcst.readthedocs.io/>`_ はコードを ast ツリーに似た構文木 (Concrete Syntax Tree) にパースし、かつ全ての書式設定の詳細を保持します。これは自動リファクタリングアプリケーション (codemod) やリンタを作成する際に有用です。

source: ? (question mark)
ast: ? (クエスチョンマーク)

source: * (asterisk)
ast: * (アスタリスク)

source: :mod:`gl` --- *Graphics Library* interface
gl: :mod:`gl` --- *Graphics Library* インターフェース

source: The :mod:`gl` module has been removed in Python 3.
gl: :mod:`gl` モジュールは Python 3 で削除されました。

source: This module provides access to the Silicon Graphics *Graphics Library*. It is available only on Silicon Graphics machines.
gl: このモジュールは Silicon Graphics の *Graphics Library* へのアクセスを提供します。 Silicon Graphics マシン上だけで利用可能です。

source: Some illegal calls to the GL library cause the Python interpreter to dump core. In particular, the use of most GL calls is unsafe before the first window is opened.
gl: GL ライブラリの不適切な呼び出しによっては、Python インタープリタがコアダンプすることがあります。特に、GL のほとんどの関数では最初のウィンドウを開く前に呼び出すのは安全ではありません。

source: The module is too large to document here in its entirety, but the following should help you to get started. The parameter conventions for the C functions are translated to Python as follows:
gl: このモジュールはとても大きいので、ここに全てを記述することはできませんが、以下の説明で出発点としては十分でしょう。 C の関数のパラメータは、以下のような決まりに従って Python に翻訳されます:

source: All (short, long, unsigned) int values are represented by Python integers.
gl: 全ての (short、long、unsigned) int は Python の整数に相当します。

source: All float and double values are represented by Python floating point numbers. In most cases, Python integers are also allowed.
gl: 全ての浮動小数点数と倍精度浮動小数点数は Python の浮動小数点数に相当します。たいていの場合、Python の整数も使えます。

source: All arrays are represented by one-dimensional Python lists. In most cases, tuples are also allowed.
gl: 全ての配列は Python の一次元のリストに相当します。たいていの場合、タプルも使えます。

source: All string and character arguments are represented by Python strings, for instance, ``winopen('Hi There!')`` and ``rotate(900, 'z')``.
gl: 全ての文字列と文字の引数は、Python の文字列に相当します。例えば、 ``winopen('Hi There!')`` と ``rotate(900, 'z')`` 。

source: All (short, long, unsigned) integer arguments or return values that are only used to specify the length of an array argument are omitted. For example, the C call ::
gl: 配列である引数の長さを特定するためだけに使われる全ての (short、long、unsigned) 整数値の引数あるいは返り値は省略されます。例えば、C の呼び出しで、 ::

source: is translated to Python as ::
gl: これは Python では、こうなります。 ::

source: Output arguments are omitted from the argument list; they are transmitted as function return values instead. If more than one value must be returned, the return value is a tuple. If the C function has both a regular return value (that is not omitted because of the previous rule) and an output argument, the return value comes first in the tuple. Examples: the C call ::
gl: 出力のための引数は、引数のリストから省略されています；代わりにこれらは関数の返り値として渡されます。もし 1 つ以上の値が返されるのなら、返り値はタプルです。もし C の関数が通常の返り値 (先のルールによって省略されません) と、出力のための引数の両方を取るなら、返り値はタプルの最初に来ます。例：C の呼び出しで、 ::

source: The following functions are non-standard or have special argument conventions:
gl: 以下の関数は一般的でないか、引数に特別な決まりを持っています:

source: Equivalent to but faster than a number of ``v3d()`` calls. The *argument* is a list (or tuple) of points. Each point must be a tuple of coordinates ``(x, y, z)`` or ``(x, y)``. The points may be 2- or 3-dimensional but must all have the same dimension. Float and int values may be mixed however. The points are always converted to 3D double precision points by assuming ``z = 0.0`` if necessary (as indicated in the man page), and for each point ``v3d()`` is called.
gl: ``v3d()`` の呼び出しに相当しますが、それよりも速いです。 *argument* は座標のリスト (あるいはタプル) です。各座標は ``(x, y, z)`` あるいは ``(x, y)`` の座標のタプルでなければなりません。座標は 2 次元あるいは 3 次元が可能ですが、全て同次元でなければなりません。ですが、浮動小数点数と整数を混合して使えます。座標は (マニュアルページにあるように) 必要であれば ``z = 0.0`` と仮定して、常に 3 次元の精密な座標に変換され、各座標について ``v3d()`` が呼び出されます。

source: Equivalent to but faster than a number of ``n3f`` and ``v3f`` calls. The argument is an array (list or tuple) of pairs of normals and points. Each pair is a tuple of a point and a normal for that point. Each point or normal must be a tuple of coordinates ``(x, y, z)``. Three coordinates must be given. Float and int values may be mixed. For each pair, ``n3f()`` is called for the normal, and then ``v3f()`` is called for the point.
gl: ``n3f`` と ``v3f`` の呼び出しに相当しますが、それらよりも速いです。引数は法線と座標とのペアからなるシーケンス (リストあるいはタプル) です。各ペアは座標と、その座標からの法線とのタプルです。各座標と各法線は ``(x, y, z)`` からなるタプルでなければなりません。3 つの座標が渡されなければなりません。浮動小数点数と整数を混合して使えます。各ペアについて、法線に対して ``n3f()`` が呼び出され、座標に対して ``v3f()`` が呼び出されます。

source: Similar to ``nvarray()`` but the pairs have the point first and the normal second.
gl: ``nvarray()`` と似ていますが、各ペアは始めに座標を、 2 番目に法線を持っています。

source: Defines a nurbs surface. The dimensions of ``ctl[][]`` are computed as follows: ``[len(s_k) - s_ord]``, ``[len(t_k) - t_ord]``.
gl: nurbs (非均一有理 B スプライン) 曲面を定義します。 ``ctl[][]`` の次元は以下のように計算されます： ``[len(s_k) - s_ord]`` 、 ``[len(t_k) - t_ord]`` 。

source: Defines a nurbs curve. The length of ctlpoints is ``len(knots) - order``.
gl: nurbs (非均一有理 B スプライン) 曲線を定義します。 ctlpoints の長さは、 ``len(knots) - order`` です。

source: Defines a piecewise-linear curve. *points* is a list of points. *type* must be ``N_ST``.
gl: 区分線形曲線 (piecewise-linear curve) を定義します。 *points* は座標のリストです。 *type* は ``N_ST`` でなければなりません。

source: The only argument to these functions specifies the desired size of the pick or select buffer.
gl: これらの関数はただ一つの引数を取り、pick/select に使うバッファのサイズを設定します。

source: These functions have no arguments. They return a list of integers representing the used part of the pick/select buffer. No method is provided to detect buffer overrun.
gl: これらの関数は引数を取りません。 pick/select に使われているバッファの大きさを示す整数のリストを返します。バッファがあふれているのを検出するメソッドはありません。

source: Here is a tiny but complete example GL program in Python::
gl: 小さいですが完全な Python の GL プログラムの例をここに挙げます： ::

source: An interface to OpenGL is also available; see information about the **PyOpenGL** project online at http://pyopengl.sourceforge.net/. This may be a better option if support for SGI hardware from before about 1996 is not required.
gl: OpenGL へのインタフェースが利用できます； 詳しくは **PyOpenGL** プロジェクト http://pyopengl.sourceforge.net/ から情報を入手できます。これは、SGI のハードウェアが1996 年頃より前である必要がないので、 OpenGL の方が良い選択かもしれません。

source: :mod:`DEVICE` --- Constants used with the :mod:`gl` module
gl: :mod:`DEVICE` --- :mod:`gl` モジュールで使われる定数

source: The :mod:`DEVICE` module has been removed in Python 3.
gl: :mod:`DEVICE` モジュールは Python 3 で削除されました。

source: This modules defines the constants used by the Silicon Graphics *Graphics Library* that C programmers find in the header file ``<gl/device.h>``. Read the module source file for details.
gl: このモジュールには、Silicon Graphics の *Graphics Library* で使われる定数が定義されています。これらは C のプログラマーがヘッダーファイル ``<gl/device.h>`` の中から使っているものです。詳しくはモジュールのソースファイルをご覧ください。

source: :mod:`GL` --- Constants used with the :mod:`gl` module
gl: :mod:`GL` --- :mod:`gl` モジュールで使われる定数

source: The :mod:`GL` module has been removed in Python 3.
gl: :mod:`GL` モジュールは Python 3 で削除されました。

source: This module contains constants used by the Silicon Graphics *Graphics Library* from the C header file ``<gl/gl.h>``. Read the module source file for details.
gl: このモジュールには Silicon Graphics の *Graphics Library* で使われる C のヘッダーファイル ``<gl/gl.h>`` の定数が定義されています。詳しくはモジュールのソースファイルをご覧ください。
