Repository: python/python-docs-ja
Catalog: library/*.po
Languages: ast, gl

source: :mod:`!ast` --- Abstract Syntax Trees
ast: :mod:`!ast` --- 抽象構文木

source: **Source code:** :source:`Lib/ast.py`
ast: **ソースコード:** :source:`Lib/ast.py`

source: The :mod:`ast` module helps Python applications to process trees of the Python abstract syntax grammar. The abstract syntax itself might change with each Python release; this module helps to find out programmatically what the current grammar looks like.
ast: :mod:`ast` モジュールは、Python アプリケーションで Python の抽象構文木を処理しやすくするものです。抽象構文そのものは、Python のリリースごとに変化する可能性があります。このモジュールを使用すると、現在の文法をプログラム上で知る助けになるでしょう。

source: An abstract syntax tree can be generated by passing :data:`ast.PyCF_ONLY_AST` as a flag to the :func:`compile` built-in function, or using the :func:`parse` helper provided in this module. The result will be a tree of objects whose classes all inherit from :class:`ast.AST`. An abstract syntax tree can be compiled into a Python code object using the built-in :func:`compile` function.
ast: 抽象構文木を作成するには、 :data:`ast.PyCF_ONLY_AST` を組み込み関数 :func:`compile` のフラグとして渡すか、あるいはこのモジュールで提供されているヘルパー関数 :func:`parse` を使います。その結果は、 :class:`ast.AST` を継承したクラスのオブジェクトのツリーとなります。抽象構文木は組み込み関数 :func:`compile` を使って Python コード・オブジェクトにコンパイルすることができます。

source: Abstract Grammar
ast: 抽象文法 (Abstract Grammar)

source: The abstract grammar is currently defined as follows:
ast: 抽象文法は、現在次のように定義されています:

source: Node classes
ast: Node クラス

source: This is the base of all AST node classes. The actual node classes are derived from the :file:`Parser/Python.asdl` file, which is reproduced :ref:`above <abstract-grammar>`. They are defined in the :mod:`!_ast` C module and re-exported in :mod:`ast`.
ast: このクラスは全ての AST ノード・クラスの基底です。実際のノード・クラスは :ref:`先に <abstract-grammar>` 示した :file:`Parser/Python.asdl` ファイルから派生したものです。これらのクラスは :mod:`!_ast` C モジュールで定義され、 :mod:`ast` にもエクスポートし直されています。

source: There is one class defined for each left-hand side symbol in the abstract grammar (for example, :class:`ast.stmt` or :class:`ast.expr`). In addition, there is one class defined for each constructor on the right-hand side; these classes inherit from the classes for the left-hand side trees. For example, :class:`ast.BinOp` inherits from :class:`ast.expr`. For production rules with alternatives (aka "sums"), the left-hand side class is abstract: only instances of specific constructor nodes are ever created.
ast: 抽象文法の左辺のシンボル一つずつにそれぞれ一つのクラスがあります (たとえば :class:`ast.stmt` や :class:`ast.expr`)。それに加えて、右辺のコンストラクタ一つずつにそれぞれ一つのクラスがあり、これらのクラスは左辺のツリーのクラスを継承しています。たとえば、 :class:`ast.BinOp` は :class:`ast.expr` から継承しています。代替を伴った生成規則 (production rules with alternatives) (別名 "sums") の場合、左辺は抽象クラスとなり、特定のコンストラクタ・ノードのインスタンスのみが作成されます。

source: Each concrete class has an attribute :attr:`!_fields` which gives the names of all child nodes.
ast: 各具象クラスは属性 :attr:`!_fields` を持っており、すべての子ノードの名前をそこに保持しています。

source: Each instance of a concrete class has one attribute for each child node, of the type as defined in the grammar. For example, :class:`ast.BinOp` instances have an attribute :attr:`left` of type :class:`ast.expr`.
ast: 具象クラスのインスタンスは、各子ノードに対してそれぞれひとつの属性を持っています。この属性は、文法で定義された型となります。たとえば :class:`ast.BinOp` のインスタンスは :attr:`left` という属性を持っており、その型は :class:`ast.expr` です。

source: If these attributes are marked as optional in the grammar (using a question mark), the value might be ``None``. If the attributes can have zero-or-more values (marked with an asterisk), the values are represented as Python lists. All possible attributes must be present and have valid values when compiling an AST with :func:`compile`.
ast: これらの属性が、文法上 (クエスチョンマークを用いて) オプションであるとマークされている場合は、その値が ``None`` となることもあります。属性が0個以上の複数の値をとりうる場合 (アスタリスクでマークされている場合) は、値は Python のリストで表されます。全ての属性は AST を :func:`compile` でコンパイルする際には存在しなければならず、そして妥当な値でなければなりません。

source: Instances of :class:`ast.expr` and :class:`ast.stmt` subclasses have :attr:`lineno`, :attr:`col_offset`, :attr:`end_lineno`, and :attr:`end_col_offset` attributes. The :attr:`lineno` and :attr:`end_lineno` are the first and last line numbers of source text span (1-indexed so the first line is line 1) and the :attr:`col_offset` and :attr:`end_col_offset` are the corresponding UTF-8 byte offsets of the first and last tokens that generated the node. The UTF-8 offset is recorded because the parser uses UTF-8 internally.
ast: :class:`ast.expr` や :class:`ast.stmt` のサブクラスのインスタンスは :attr:`lineno`, :attr:`col_offset`, :attr:`end_lineno`, および :attr:`end_col_offset` 属性を持ちます。 :attr:`lineno` と :attr:`end_lineno` はソーステキストの範囲を最初と最後の行番号で表し (1 から数え始めるので、最初の行の行番号は 1 となります)、 :attr:`col_offset` と :attr:`end_col_offset` はノードが生成した最初と最後のトークンの UTF-8 バイトオフセットです。 UTF-8 オフセットはパーサが内部で使用するので記録されます。

source: Note that the end positions are not required by the compiler and are therefore optional. The end offset is *after* the last symbol, for example one can get the source segment of a one-line expression node using ``source_line[node.col_offset : node.end_col_offset]``.
ast: コンパイラは終了位置を必要としないことに注意してください。このため終了位置は省略可能です。終了位置を示すオフセットは最後のシンボルの *後の位置* になります。例えば一行で書かれた式のソースコードのセグメントは ``source_line[node.col_offset : node.end_col_offset]`` により取得できます。

source: The constructor of a class :class:`ast.T` parses its arguments as follows:
ast: クラス :class:`ast.T` のコンストラクタは引数を次のように解析します:

source: If there are positional arguments, there must be as many as there are items in :attr:`T._fields`; they will be assigned as attributes of these names.
ast: 位置引数があるとすれば、 :attr:`T._fields` にあるのと同じだけの個数が無ければなりません。これらの引数はそこにある名前を持った属性として割り当てられます。

source: If there are keyword arguments, they will set the attributes of the same names to the given values.
ast: キーワード引数があるとすれば、それらはその名前の属性にその値を割り当てられます。

source: For example, to create and populate an :class:`ast.UnaryOp` node, you could use ::
ast: たとえば、 :class:`ast.UnaryOp` ノードを生成して属性を埋めるには、次のようにすることができます ::

source: Class :class:`ast.Constant` is now used for all constants.
ast: :class:`ast.Constant` が全ての定数に使われるようになりました。

source: Simple indices are represented by their value, extended slices are represented as tuples.
ast: 単純なインデックスはその値で表現され、幅を持つスライスはタプルで表現されます。

source: The descriptions of the specific node classes displayed here were initially adapted from the fantastic `Green Tree Snakes <https://greentreesnakes.readthedocs.io/en/latest/>`__ project and all its contributors.
ast: ここに示されている特定のノードクラスについての記述は、素晴らしい `Green Tree Snakes <https://greentreesnakes.readthedocs.io/en/latest/>`__ プロジェクトとそのすべての貢献者の成果物をもとにしています。

source: Literals
ast: リテラル

source: A constant value. The ``value`` attribute of the ``Constant`` literal contains the Python object it represents. The values represented can be simple types such as a number, string or ``None``, but also immutable container types (tuples and frozensets) if all of their elements are constant.
ast: 定数です。 ``Constant`` リテラルの ``value`` 属性は定数値を表す Python オブジェクトを保持します。定数として表現される値は数値、文字列、または ``None`` のような単純な型のほかに、全ての要素が定数であるイミュータブルなコンテナ型 (tuples および frozensets) も設定可能です。

source: Node representing a single formatting field in an f-string. If the string contains a single formatting field and nothing else the node can be isolated otherwise it appears in :class:`JoinedStr`.
ast: このノードは f-string における単一の書式指定置換フィールドを表現します。文字列が単一の置換フィールドしか持たず、他に何も含まない場合は、ノードは単独で存在できます。そうでない場合は :class:`JoinedStr` の一部としてあらわれます。

source: ``value`` is any expression node (such as a literal, a variable, or a function call).
ast: ``value`` は式ツリーのノードのいずれか (リテラル、変数、関数呼び出しなど) です。

source: ``conversion`` is an integer:
ast: ``conversion`` は整数です:

source: -1: no formatting
ast: -1: 書式指定なし

source: 115: ``!s`` string formatting
ast: 115: ``!s`` 文字列書式指定

source: 114: ``!r`` repr formatting
ast: 114: ``!r`` repr 書式指定

source: 97: ``!a`` ascii formatting
ast: 97: ``!a`` ascii 書式指定

source: ``format_spec`` is a :class:`JoinedStr` node representing the formatting of the value, or ``None`` if no format was specified. Both ``conversion`` and ``format_spec`` can be set at the same time.
ast: ``format_spec`` は値の書式指定を表現する :class:`JoinedStr` ノード、もしくは書式指定がない場合は ``None`` です。 ``conversion`` と ``format_spec`` を同時に設定することができます。

source: An f-string, comprising a series of :class:`FormattedValue` and :class:`Constant` nodes.
ast: :class:`FormattedValue` ノードと :class:`Constant` ノードの集まりからなる f-string です。

source: A list or tuple. ``elts`` holds a list of nodes representing the elements. ``ctx`` is :class:`Store` if the container is an assignment target (i.e. ``(x,y)=something``), and :class:`Load` otherwise.
ast: リストまたはタプルをあらわします。 ``elts`` は内包する要素を表現するノードのリストを保持します。 ``ctx`` はコンテナが代入のターゲットである場合 (たとえば ``(x,y)=something`` のような場合) は :class:`Store` であり、そうでない場合は :class:`Load` です。

source: A set. ``elts`` holds a list of nodes representing the set's elements.
ast: 集合 (set) をあらわします。 ``elts`` は集合の各要素を表現するノードのリストを保持します。

source: A dictionary. ``keys`` and ``values`` hold lists of nodes representing the keys and the values respectively, in matching order (what would be returned when calling :code:`dictionary.keys()` and :code:`dictionary.values()`).
ast: 辞書をあらわします。 ``keys`` と ``values`` はそれぞれキーと値のノードのリスト を順序が一致した形で (それぞれ :code:`dictionary.keys()` と :code:`dictionary.values()` を呼び出したときに返される順序で) 保持します。

source: When doing dictionary unpacking using dictionary literals the expression to be expanded goes in the ``values`` list, with a ``None`` at the corresponding position in ``keys``.
ast: 辞書リテラルを使って辞書を展開した場合、展開された式ツリーにおいて辞書は ``values`` リストに入り、 ``keys`` の対応する位置には ``None`` が入ります。

source: Variables
ast: 変数

source: A variable name. ``id`` holds the name as a string, and ``ctx`` is one of the following types.
ast: 変数名をあらわします。 ``id`` は変数名を文字列で保持し、 ``ctx`` は以下に示す型のいずれかです。

source: Variable references can be used to load the value of a variable, to assign a new value to it, or to delete it. Variable references are given a context to distinguish these cases.
ast: 変数の参照は変数の値をロードするか、新しい値を割り当てるか、または値を削除するために使うことができます。変数の参照はこれら3つの場合を区別するためのコンテキストによって与えられます。

source: A ``*var`` variable reference. ``value`` holds the variable, typically a :class:`Name` node. This type must be used when building a :class:`Call` node with ``*args``.
ast: ``*var`` 形式の変数の参照をあらわします。 ``value`` は変数、典型的には :class:`Name` ノード、を保持します。この型は ``*args`` を伴う関数呼び出しノード :class:`Call` を構築する際に使用します。

source: Expressions
ast: 式 (expression)

source: When an expression, such as a function call, appears as a statement by itself with its return value not used or stored, it is wrapped in this container. ``value`` holds one of the other nodes in this section, a :class:`Constant`, a :class:`Name`, a :class:`Lambda`, a :class:`Yield` or :class:`YieldFrom` node.
ast: 関数呼び出しのような式がそれ自身で文となり、戻り値が使われないかまたは保存されないとき、その式はこのコンテナでラップされます。 ``value`` はこの節で説明する他のノード、 :class:`Constant` ノード、 :class:`Name` ノード、 :class:`Lambda` ノード :class:`Yield` ノードまたは :class:`YieldFrom` ノードのいずれかを保持します。

source: A unary operation. ``op`` is the operator, and ``operand`` any expression node.
ast: 単項演算をあらわします。 ``op`` は演算子で、 ``operand`` は任意の式ツリーのノードです。

source: Unary operator tokens. :class:`Not` is the ``not`` keyword, :class:`Invert` is the ``~`` operator.
ast: 単項演算の演算子をあらわします。 :class:`Not` は論理否定キーワード ``not`` であり、 :class:`Invert` はビット反転演算子 ``~`` です。

source: A binary operation (like addition or division). ``op`` is the operator, and ``left`` and ``right`` are any expression nodes.
ast: (加算や減算のような) 二項演算をあらわします。 ``op`` は演算子、 ``left`` と ``right`` は任意の式ツリーのノードです。

source: Binary operator tokens.
ast: 二項演算の演算子をあらわします。

source: A boolean operation, 'or' or 'and'. ``op`` is :class:`Or` or :class:`And`. ``values`` are the values involved. Consecutive operations with the same operator, such as ``a or b or c``, are collapsed into one node with several values.
ast: 'or' や 'and' のような論理演算をあらわします。 ``op`` は :class:`Or` または :class:`And` です。 ``values`` は必要な値のリストです。 ``a or b or c`` のように同じ演算子を使う連続した演算は、複数の値を持った単一のノードとして表現されます。

source: This doesn't include ``not``, which is a :class:`UnaryOp`.
ast: ``not`` は単項演算 :class:`UnaryOp` のため、ここには含まれません。

source: Boolean operator tokens.
ast: 論理演算の演算子をあらわします。

source: A comparison of two or more values. ``left`` is the first value in the comparison, ``ops`` the list of operators, and ``comparators`` the list of values after the first element in the comparison.
ast: 2つ以上の値の比較をあらわします。 ``left`` 比較の中の最初の値、``ops`` は演算子のリスト、 ``comparators`` は2つ目以降の値のリストです。

source: Comparison operator tokens.
ast: 比較演算の演算子をあらわします。

source: A function call. ``func`` is the function, which will often be a :class:`Name` or :class:`Attribute` object. Of the arguments:
ast: 関数呼び出しをあらわします。 ``func`` は関数で、多くの場合 :class:`Name` または :class:`Attribute` のオブジェクトです。 関数呼び出しの引数:

source: ``args`` holds a list of the arguments passed by position.
ast: ``args`` は位置引数のリストを保持します。

source: A keyword argument to a function call or class definition. ``arg`` is a raw string of the parameter name, ``value`` is a node to pass in.
ast: 関数呼び出しまたはクラス定義のキーワード引数をあらわします。 ``arg`` はパラメータ名をあらわす文字列、 ``value`` は引数に渡す値をあらわすノードです。

source: An expression such as ``a if b else c``. Each field holds a single node, so in the following example, all three are :class:`Name` nodes.
ast: ``a if b else c`` のような式をあらわします。各フィールドは単一のノードを保持します。以下の例では、3つの式ノードはすべて :class:`Name` ノードです。

source: Attribute access, e.g. ``d.keys``. ``value`` is a node, typically a :class:`Name`. ``attr`` is a bare string giving the name of the attribute, and ``ctx`` is :class:`Load`, :class:`Store` or :class:`Del` according to how the attribute is acted on.
ast: たとえば ``d.keys`` のような属性へのアクセスです。 ``value`` はノードで、典型的には :class:`Name` です。 ``attr`` は属性名を与える生の文字列で、 ``ctx`` はその属性がどのように振る舞うかに応じて :class:`Load`、 :class:`Store` または :class:`Del` のいずれかです。

source: A named expression. This AST node is produced by the assignment expressions operator (also known as the walrus operator). As opposed to the :class:`Assign` node in which the first argument can be multiple nodes, in this case both ``target`` and ``value`` must be single nodes.
ast: 代入式です。この AST ノードは代入式演算子（ウォルラス演算子、または「セイウチ演算子」としても知られています）によって生成されます。第一引数が複数のノードであってもよい :class:`Assign` ノードと異なり、このノードの場合は ``target`` と ``value`` の両方が単一のノードでなければなりません。

source: Subscripting
ast: 配列要素の参照 (Subscripting)

source: A subscript, such as ``l[1]``. ``value`` is the subscripted object (usually sequence or mapping). ``slice`` is an index, slice or key. It can be a :class:`Tuple` and contain a :class:`Slice`. ``ctx`` is :class:`Load`, :class:`Store` or :class:`Del` according to the action performed with the subscript.
ast: ``l[1]`` のような配列要素の参照をあらわします。 ``value`` は参照元のオブジェクトです (通常シーケンス型またはマッピング型)。 ``slice`` はインデックス、スライス、またはキーです。 :class:`Slice` を含む :class:`Tuple` でもかまいません。 ``ctx`` は要素の参照により実行されるアクションに応じて :class:`Load`、 :class:`Store` または :class:`Del` のいずれかです。

source: Regular slicing (on the form ``lower:upper`` or ``lower:upper:step``). Can occur only inside the *slice* field of :class:`Subscript`, either directly or as an element of :class:`Tuple`.
ast: 基本的なスライス操作 (``lower:upper`` や ``lower:upper:step`` の形式) をあらわします。 :class:`Subscript` の *slice* フィールドでの直接指定か、または :class:`Tuple` の要素として指定する場合のみ利用可能です。

source: Comprehensions
ast: 内包表記 (Comprehension)

source: List and set comprehensions, generator expressions, and dictionary comprehensions. ``elt`` (or ``key`` and ``value``) is a single node representing the part that will be evaluated for each item.
ast: リストや集合の内包表記、ジェネレータ、および辞書の内包表記です。 ``elt`` (または ``key`` と ``value``) は各要素として評価される部品をあらわす単一のノードです。

source: ``generators`` is a list of :class:`comprehension` nodes.
ast: ``generators`` は :class:`comprehension` ノードのリストです。

source: One ``for`` clause in a comprehension. ``target`` is the reference to use for each element - typically a :class:`Name` or :class:`Tuple` node. ``iter`` is the object to iterate over. ``ifs`` is a list of test expressions: each ``for`` clause can have multiple ``ifs``.
ast: 内包表記におけるひとつの ``for`` 節をあらわします。 ``target`` は各要素への参照です - 典型的には :class:`Name` または :class:`Tuple` ノードです。 ``iter`` はイテレートする対象のオブジェクトです。 ``ifs`` は条件節のリストです: 各 ``for`` 節は複数の ``ifs`` を持つことができます。

source: ``is_async`` indicates a comprehension is asynchronous (using an ``async for`` instead of ``for``). The value is an integer (0 or 1).
ast: ``is_async`` は内包表記が非同期であることを示します (``async for`` を ``for`` の代わりに使います)。値は整数です (0 または 1)。

source: Statements
ast: 文 (Statements)

source: An assignment. ``targets`` is a list of nodes, and ``value`` is a single node.
ast: 代入です。 ``targets`` はノードのリスト、 ``value`` は単一のノードです。

source: Multiple nodes in ``targets`` represents assigning the same value to each. Unpacking is represented by putting a :class:`Tuple` or :class:`List` within ``targets``.
ast: ``targets`` の複数のノードは、それぞれに対して同じ値を代入することをあらわします。分割代入は ``targets`` 内に :class:`Tuple` または :class:`List` を置くことで表現されます。

source: ``type_comment`` is an optional string with the type annotation as a comment.
ast: ``type_comment`` はコメントとして型アノテーションをあらわすオプション文字列です。

source: Augmented assignment, such as ``a += 1``. In the following example, ``target`` is a :class:`Name` node for ``x`` (with the :class:`Store` context), ``op`` is :class:`Add`, and ``value`` is a :class:`Constant` with value for 1.
ast: ``a += 1`` のような累積代入をあらわします。下記の例では、 ``target`` は (:class:`Store` コンテキストを伴う) ``x`` のための :class:`Name` ノード、 ``op`` は :class:`Add` 演算子、そして ``value`` は定数1をあらわす :class:`Constant` ノードです。

source: The ``target`` attribute cannot be of class :class:`Tuple` or :class:`List`, unlike the targets of :class:`Assign`.
ast: :class:`Assign` と異なり、 ``target`` 属性は class :class:`Tuple` や :class:`List` であってはいけません。

source: A ``raise`` statement. ``exc`` is the exception object to be raised, normally a :class:`Call` or :class:`Name`, or ``None`` for a standalone ``raise``. ``cause`` is the optional part for ``y`` in ``raise x from y``.
ast: ``raise`` 文をあらわします。 ``exc`` は送出される例外オブジェクトで、通常は :class:`Call` または :class:`Name`、 もしくは単独の ``raise`` では ``None`` を指定します。 ``cause`` はオプションで、 ``raise x from y`` の ``y`` にあたります。

source: An assertion. ``test`` holds the condition, such as a :class:`Compare` node. ``msg`` holds the failure message.
ast: アサーションです。 ``test`` は :class:`Compare` ノードなどのような条件を保持します。 ``msg`` は失敗した時のメッセージを保持します。

source: Represents a ``del`` statement. ``targets`` is a list of nodes, such as :class:`Name`, :class:`Attribute` or :class:`Subscript` nodes.
ast: ``del`` 文をあらわします。 ``targets`` は :class:`Name`, :class:`Attribute`, :class:`Subscript` などのノードのリストです。

source: A ``pass`` statement.
ast: ``pass`` 文をあらわします。

source: Other statements which are only applicable inside functions or loops are described in other sections.
ast: 関数またはループの内部でのみ適用可能な他の文は、別のセクションで説明します。

source: Imports
ast: インポート

source: An import statement. ``names`` is a list of :class:`alias` nodes.
ast: インポート文です。 ``names`` は :class:`alias` ノードのリストです。

source: Represents ``from x import y``. ``module`` is a raw string of the 'from' name, without any leading dots, or ``None`` for statements such as ``from . import foo``. ``level`` is an integer holding the level of the relative import (0 means absolute import).
ast: ``from x import y`` をあらわします。 ``module`` は 'from' でインポートする先頭がドットでないモジュール名をあらわす文字列か、または ``from . import foo`` のような構文の場合は ``None`` を指定します。 ``level`` は相対インポートのレベルを表す整数を保持します (0 は絶対インポートを意味します)。

source: Both parameters are raw strings of the names. ``asname`` can be ``None`` if the regular name is to be used.
ast: いずれのパラメータも名前をあらわす生の文字列です。 ``asname`` は標準の名前を使う場合は ``None`` を指定できます。

source: Control flow
ast: 制御フロー

source: Optional clauses such as ``else`` are stored as an empty list if they're not present.
ast: ``else`` 節のようなオプションの節が存在しない場合は、空のリストとして保存されます。

source: An ``if`` statement. ``test`` holds a single node, such as a :class:`Compare` node. ``body`` and ``orelse`` each hold a list of nodes.
ast: ``if`` 文です。 ``test`` は :class:`Compare` ノードなどの単一のノードを保持します。 ``body`` と ``orelse`` はそれぞれノードのリストを保持します。

source: ``elif`` clauses don't have a special representation in the AST, but rather appear as extra :class:`If` nodes within the ``orelse`` section of the previous one.
ast: ``elif`` 節は AST において固有の表現を持たず、先行する節をあらわすノードの ``orelse`` セクションに追加の :class:`If` ノードとして現れます。

source: A ``while`` loop. ``test`` holds the condition, such as a :class:`Compare` node.
ast: ``while`` ループです。 ``test`` は :class:`Compare` のような条件をあらわすノードを保持します。

source: The ``break`` and ``continue`` statements.
ast: ``break`` 文および ``continue`` 文です。

source: ``try`` blocks. All attributes are list of nodes to execute, except for ``handlers``, which is a list of :class:`ExceptHandler` nodes.
ast: ``try`` ブロックです。 :class:`ExceptHandler` ノードのリストである ``handlers`` を除き、全ての属性はそれぞれの節で実行するノードのリストです。

source: A single ``except`` clause. ``type`` is the exception type it will match, typically a :class:`Name` node (or ``None`` for a catch-all ``except:`` clause). ``name`` is a raw string for the name to hold the exception, or ``None`` if the clause doesn't have ``as foo``. ``body`` is a list of nodes.
ast: 単一の ``except`` 節をあらわします。 ``type`` はこの節にマッチする例外のタイプで、典型的には :class:`Name` ノードです (``None`` を指定すると全ての例外をキャッチする ``except:`` 節をあらわします)。 ``name`` は例外オブジェクトを保持する変数の名前をあらわす生の文字列で、 ``as foo`` を持たない節の場合は ``None`` を指定します。 ``body`` はノードのリストです。

source: A ``with`` block. ``items`` is a list of :class:`withitem` nodes representing the context managers, and ``body`` is the indented block inside the context.
ast: ``with`` ブロックです。 ``items`` は :class:`withitem` ノードのリストで、コンテキストマネージャのリストをあらわします。また ``body`` はコンテキスト内にインデントされたブロックです。

source: A single context manager in a ``with`` block. ``context_expr`` is the context manager, often a :class:`Call` node. ``optional_vars`` is a :class:`Name`, :class:`Tuple` or :class:`List` for the ``as foo`` part, or ``None`` if that isn't used.
ast: ``with`` ブロックにおける単一のコンテキストマネージャをあらわします。 ``context_expr`` はコンテキストマネージャで、しばしば :class:`Call` ノードが設定されます。 ``optional_vars`` は ``as foo`` に相当する :class:`Name`, :class:`Tuple` または :class:`List` のいずれかのノードか、または、この部分が不要な場合は ``None`` を設定します。

source: Function and class definitions
ast: 関数およびクラス定義

source: A function definition.
ast: 関数定義です。

source: ``name`` is a raw string of the function name.
ast: ``name`` は関数名をあらわす生の文字列です。

source: ``args`` is an :class:`arguments` node.
ast: ``args`` は引数をあらわす :class:`arguments` ノードです。

source: ``body`` is the list of nodes inside the function.
ast: ``body`` は関数の本体をあらわすノードのリストです。

source: ``decorator_list`` is the list of decorators to be applied, stored outermost first (i.e. the first in the list will be applied last).
ast: ``decorator_list`` は関数に適用されるデコレータのリストで、外側のデコレータがリストの先頭に保存されます (すなわち、リストの先頭にあるデコレータが最後に適用されます)。

source: ``returns`` is the return annotation.
ast: ``returns`` は戻り値に対する注釈です。

source: ``lambda`` is a minimal function definition that can be used inside an expression. Unlike :class:`FunctionDef`, ``body`` holds a single node.
ast: ``lambda`` は式の中で使うことができる最小限の関数定義です。 :class:`FunctionDef` ノードと異なり、 ``body`` は単一のノードとなります。

source: The arguments for a function.
ast: 関数の引数

source: ``posonlyargs``, ``args`` and ``kwonlyargs`` are lists of :class:`arg` nodes.
ast: ``posonlyargs``, ``args`` および ``kwonlyargs`` はそれぞれ :class:`arg` ノードのリストです。

source: ``vararg`` and ``kwarg`` are single :class:`arg` nodes, referring to the ``*args, **kwargs`` parameters.
ast: ``vararg`` と ``kwarg`` はそれぞれ単一の :class:`arg` ノードで、 ``*args, **kwargs`` パラメータに相当します。

source: ``kw_defaults`` is a list of default values for keyword-only arguments. If one is ``None``, the corresponding argument is required.
ast: ``kw_defaults`` はキーワード専用引数に対するデフォルト値のリストです。値が ``None`` の場合、対応する引数は必須となります。

source: ``defaults`` is a list of default values for arguments that can be passed positionally. If there are fewer defaults, they correspond to the last n arguments.
ast: ``defaults`` は位置引数として渡すことのできる引数に対するデフォルト値のリストです。デフォルト値の数nが位置引数の数より少ない場合、それらは最後のn個の引数に割り当てられます。

source: ``type_comment`` is an optional string with the type annotation as a comment
ast: ``type_comment`` はコメントとして型アノテーションをあらわすオプション文字列です。

source: A ``return`` statement.
ast: ``return`` 文です。
